Revit 2027 API
BuiltInFailures.FloorFailures.FloorSlopeExceedsThreshold Property
 Thickness of this Floor may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FloorSlopeExceedsThreshold { get; }
Public Shared ReadOnly Property FloorSlopeExceedsThreshold As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FloorSlopeExceedsThreshold {
	FailureDefinitionId^ get ();
}
static member FloorSlopeExceedsThreshold : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FloorFailures Class
Autodesk.Revit.DB Namespace